[
  {
    "title": "Rendering",
    "section": "Untitled Section",
    "section_id": "untitled-section",
    "heading_level": 3,
    "content": "Menu\n\nUsing App Router\n\nFeatures available in /app\n\nUsing Latest Version\n\n15.2.4\n\n[App Router](/docs/app)[Building Your Application](/docs/app/building-your-application)Rendering",
    "preview": "Menu Using App Router Features available in /app Using Latest Version 15.2.4 [App Router](/docs/app)[Building Your Application](/docs/app/building-your-application)Rendering",
    "url": "https://nextjs.org/docs/app/building-your-application/rendering#untitled-section",
    "position": 0
  },
  {
    "title": "Rendering",
    "section": "Rendering",
    "section_id": "rendering",
    "heading_level": 1,
    "content": "# Rendering\n\nRendering converts the code you write into user interfaces. React and Next.js allow you to create hybrid web applications where parts of your code can be rendered on the server or the client. This section will help you understand the differences between these rendering environments, strategies, and runtimes.",
    "preview": "Rendering converts the code you write into user interfaces. React and Next.js allow you to create hybrid web applications where parts of your code can be rendered on the server or the client. This section will help you understand the differences between these rendering environments, strategies, and",
    "url": "https://nextjs.org/docs/app/building-your-application/rendering#rendering",
    "position": 1
  },
  {
    "title": "Rendering",
    "section": "[Fundamentals](#fundamentals)",
    "section_id": "fundamentals-fundamentals",
    "heading_level": 2,
    "content": "## [Fundamentals](#fundamentals)\n\nTo start, it's helpful to be familiar with three foundational web concepts:\n\n* The [Environments](#rendering-environments) your application code can be executed in: the server and the client.\n* The [Request-Response Lifecycle](#request-response-lifecycle) that's initiated when a user visits or interacts with your application.\n* The [Network Boundary](#network-boundary) that separates server and client code.",
    "preview": "To start, it's helpful to be familiar with three foundational web concepts: * The [Environments](#rendering-environments) your application code can be executed in: the server and the client. * The [Request-Response Lifecycle](#request-response-lifecycle) that's initiated when a user visits or inter",
    "url": "https://nextjs.org/docs/app/building-your-application/rendering#fundamentals-fundamentals",
    "position": 2
  },
  {
    "title": "Rendering",
    "section": "[Rendering Environments](#rendering-environments)",
    "section_id": "rendering-environments-rendering-environments",
    "heading_level": 3,
    "content": "### [Rendering Environments](#rendering-environments)\n\nThere are two environments where web applications can be rendered: the client and the server.\n\n[Image: Client and Server Environments][Image: Client and Server Environments]\n\n* The **client** refers to the browser on a user's device that sends a request to a server for your application code. It then turns the response from the server into a user interface.\n* The **server** refers to the computer in a data center that stores your application code, receives requests from a client, and sends back an appropriate response.\n\nHistorically, developers had to use different languages (e.g. JavaScript, PHP) and frameworks when writing code for the server and the client. With React, developers can use the **same language** (JavaScript), and the **same framework** (e.g. Next.js or your framework of choice). This flexibility allows you to seamlessly write code for both environments without context switching.\n\nHowever, each environment has its own set of capabilities and constraints. Therefore, the code you write for the server and the client is not always the same. There are certain operations (e.g. data fetching or managing user state) that are better suited for one environment over the other.\n\nUnderstanding these differences is key to effectively using React and Next.js. We'll cover the differences and use cases in more detail on the [Server](/docs/app/building-your-application/rendering/server-components) and [Client](/docs/app/building-your-application/rendering/client-components) Components pages, for now, let's continue building on our foundation.",
    "preview": "There are two environments where web applications can be rendered: the client and the server. [Image: Client and Server Environments][Image: Client and Server Environments] * The **client** refers to the browser on a user's device that sends a request to a server for your application code. It then",
    "url": "https://nextjs.org/docs/app/building-your-application/rendering#rendering-environments-rendering-environments",
    "position": 3
  },
  {
    "title": "Rendering",
    "section": "[Request-Response Lifecycle](#request-response-lifecycle)",
    "section_id": "request-response-lifecycle-request-response-lifecycle",
    "heading_level": 3,
    "content": "### [Request-Response Lifecycle](#request-response-lifecycle)\n\nBroadly speaking, all websites follow the same **Request-Response Lifecycle**:\n\n1. **User Action:** The user interacts with a web application. This could be clicking a link, submitting a form, or typing a URL directly into the browser's address bar.\n2. **HTTP Request:** The client sends an [HTTP](https://developer.mozilla.org/docs/Web/HTTP) request to the server that contains necessary information about what resources are being requested, what method is being used (e.g. `GET`, `POST`), and additional data if necessary.\n3. **Server:** The server processes the request and responds with the appropriate resources. This process may take a couple of steps like routing, fetching data, etc.\n4. **HTTP Response:** After processing the request, the server sends an HTTP response back to the client. This response contains a status code (which tells the client whether the request was successful or not) and requested resources (e.g. HTML, CSS, JavaScript, static assets, etc).\n5. **Client:** The client parses the resources to render the user interface.\n6. **User Action:** Once the user interface is rendered, the user can interact with it, and the whole process starts again.\n\nA major part of building a hybrid web application is deciding how to split the work in the lifecycle, and where to place the Network Boundary.",
    "preview": "Broadly speaking, all websites follow the same **Request-Response Lifecycle**: 1. **User Action:** The user interacts with a web application. This could be clicking a link, submitting a form, or typing a URL directly into the browser's address bar. 2. **HTTP Request:** The client sends an [HTTP](ht",
    "url": "https://nextjs.org/docs/app/building-your-application/rendering#request-response-lifecycle-request-response-lifecycle",
    "position": 4
  },
  {
    "title": "Rendering",
    "section": "[Network Boundary](#network-boundary)",
    "section_id": "network-boundary-network-boundary",
    "heading_level": 3,
    "content": "### [Network Boundary](#network-boundary)\n\nIn web development, the **Network Boundary** is a conceptual line that separates the different environments. For example, the client and the server, or the server and the data store.\n\nIn React, you choose where to place the client-server network boundary wherever it makes the most sense.\n\nBehind the scenes, the work is split into two parts: the **client module graph** and the **server module graph**. The server module graph contains all the components that are rendered on the server, and the client module graph contains all components that are rendered on the client.\n\nIt may be helpful to think about module graphs as a visual representation of how files in your application depend on each other.\n\nYou can use the React `\"use client\"` convention to define the boundary. There's also a `\"use server\"` convention, which tells React to do some computational work on the server.",
    "preview": "In web development, the **Network Boundary** is a conceptual line that separates the different environments. For example, the client and the server, or the server and the data store. In React, you choose where to place the client-server network boundary wherever it makes the most sense. Behind the",
    "url": "https://nextjs.org/docs/app/building-your-application/rendering#network-boundary-network-boundary",
    "position": 5
  },
  {
    "title": "Rendering",
    "section": "[Building Hybrid Applications](#building-hybrid-applications)",
    "section_id": "building-hybrid-applications-building-hybrid-applications",
    "heading_level": 2,
    "content": "## [Building Hybrid Applications](#building-hybrid-applications)\n\nWhen working in these environments, it's helpful to think of the flow of the code in your application as **unidirectional**. In other words, during a response, your application code flows in one direction: from the server to the client.\n\nIf you need to access the server from the client, you send a **new** request to the server rather than re-use the same request. This makes it easier to understand where to render your components and where to place the Network Boundary.\n\nIn practice, this model encourages developers to think about what they want to execute on the server first, before sending the result to the client and making the application interactive.\n\nThis concept will become clearer when we look at how you can [interleave client and server components](/docs/app/building-your-application/rendering/composition-patterns) in the same component tree.\n\n[### Server Components\n\nLearn how you can use React Server Components to render parts of your application on the server.](/docs/app/building-your-application/rendering/server-components)[### Client Components\n\nLearn how to use Client Components to render parts of your application on the client.](/docs/app/building-your-application/rendering/client-components)[### Composition Patterns\n\nRecommended patterns for using Server and Client Components.](/docs/app/building-your-application/rendering/composition-patterns)[### Partial Prerendering\n\nLearn how to combine the benefits of static and dynamic rendering with Partial Prerendering.](/docs/app/building-your-application/rendering/partial-prerendering)[### Runtimes\n\nLearn about the switchable runtimes (Edge and Node.js) in Next.js.](/docs/app/building-your-application/rendering/edge-and-nodejs-runtimes)\n\nWas this helpful?\n\nsupported.\n\nSend",
    "preview": "When working in these environments, it's helpful to think of the flow of the code in your application as **unidirectional**. In other words, during a response, your application code flows in one direction: from the server to the client. If you need to access the server from the client, you send a *",
    "url": "https://nextjs.org/docs/app/building-your-application/rendering#building-hybrid-applications-building-hybrid-applications",
    "position": 6
  }
]